app/Controllers/ProductosController.php

                'estado' => $estado
            ];

            $this->productModel->insert($data);
---
INSERT INTO `products` (`nombre`, `precio`, `imagen`, `categoria_id`, `tipo_id`, `estado`) VALUES ('Carlita', '999', '1684131259_420181755192fd8d077f.png', '1', '1', 'SI')