app/Models/CategoriaModel.php

    public function getCategoryById($id)
    {
        return $this->where('id', $id)->first();
---
SELECT *
FROM `categorias`
WHERE `id` = '2'
 LIMIT 1