app/Models/DomicilioModel.php

    public function getDomicilioById($id)
    {
        $data = $this->where('id', $id);
        return $data->get()->getRowArray();
---
SELECT *
FROM `domicilios`
WHERE `id` = 12