app/Models/ProductoModel.php

SELECT *
FROM `products`
WHERE `id` = 46
 LIMIT 1
---
    public function getProductById($id)
    {
        return $this->where('id', $id)->first();

UPDATE `products` SET `nombre` = 'Café Molido Sabor Vainilla', `precio` = '8635.2', `categoria_id` = '2', `tipo_id` = '1', `estado` = 'NO', `imagen` = '1684179723_4226cb98cbed95ad822c.png'
WHERE `products`.`id` IN (46)
---
    public function updateProduct($id, $datos)
    {
        return $this->update($id, $datos);