app/Models/ProductoModel.php

SELECT *
FROM `products`
ORDER BY `id` ASC
---
    public function getProducts($order_type = 'ASC')
    {
        return $this->orderBy('id', $order_type)->findAll();

SELECT *
FROM `products`
WHERE `id` = 11
 LIMIT 1
---
    public function getProductById($id)
    {
        return $this->where('id', $id)->first();

UPDATE `products` SET `nombre` = 'Café grano molido', `precio` = '1200', `categoria_id` = '3', `tipo_id` = '1', `estado` = 'SI', `imagen` = '1684130691_fbd4b66a3282e866e20a.png'
WHERE `products`.`id` IN (11)
---
    public function updateProduct($id, $datos)
    {
        return $this->update($id, $datos);