app/Models/TipoModel.php

SELECT *
FROM `tipos`
WHERE `id` = '1'
 LIMIT 1
---
    public function getTypeById($id)
    {
        return $this->where('id', $id)->first();