app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `email` = 'johanguevara1221@gmail.com'
---
    public function getUserByEmail($email)
    {
        $data = $this->where('email', $email);
        return $data->get()->getRowArray();

UPDATE `usuarios` SET `domicilio_id` = 2
WHERE `usuarios`.`id` IN ('41')
---
    public function addDomicilio($id, $domicilioId)
    {
        return $this->update($id, ['domicilio_id' => $domicilioId]);